## Data cleaning

Data cleaning is the process of fixing or removing incorrect,corrupted,incorrectly formatted duplicate incomplete data within a data set.

In [49]:
import pandas as pd
import numpy as np

In [1]:
titanic = pd.read_csv('C:\\Users\\User\\Desktop\\data_science bootcamp\\Dataset\\modified_titanic_data.csv')

NameError: name 'pd' is not defined

In [51]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,OnboardTime,Unnamed: 13
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,1912-04-10 09:42:47,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,-,1,0,PC 17599,71.2833,C85,C,1912-04-10 09:54:01,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,1912-04-10 09:55:37,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,na,1,0,113803,53.1000,C123,S,1912-04-10 08:06:51,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,1912-04-10 09:10:39,NaN

In [52]:
# df = df.drop(columns="unnamed:13")
# or
titanic.drop(columns="Unnamed: 13",inplace = True)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,OnboardTime
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,1912-04-10 09:42:47
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,-,1,0,PC 17599,71.2833,C85,C,1912-04-10 09:54:01
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,1912-04-10 09:55:37
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,na,1,0,113803,53.1000,C123,S,1912-04-10 08:06:51
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,1912-04-10 09:10:39

In [37]:
##False() mark all duplicates as True

titanic[titanic.duplicated(keep=False)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,OnboardTime,Unnamed: 13
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.55,C103,S,1912-04-10 08:40:38,NaN
18,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.55,C103,S,1912-04-10 08:40:38,NaN
29,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.55,C103,S,1912-04-10 08:40:38,NaN
55,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29,1,0,2926,26.00,NaN,S,1912-04-10 09:32:51,NaN
62,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29,1,0,2926,26.00,NaN,S,1912-04-10 09:32:51,NaN
83,81,0,3,"Waelens, Mr. Achille",male,22,0,0,345767,9.00,NaN,S,1912-04-10 09:38:42,NaN
97,81,0,3,"Waelens, Mr. Achille",male,22,0,0,345767,9.00,NaN,S,1912-04-10 09:38:42,NaN

In [38]:
## The len() python method retuns the length of a list,string,dictionary,or any other iterable data format in 
## python
len(titanic)

895

In [16]:
## First () mark dulicates as True except for the first occurence
titanic = titanic.drop_duplicates(keep="first")
titanic
len(titanic)

891

In [18]:
titanic[titanic.duplicated(keep=False)]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, OnboardTime, Unnamed: 13]
Index: []

## Null Data

In [19]:
### isnull().sum() returns the number of missing values in the data set.
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            178
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
OnboardTime      0
Unnamed: 13    891
dtype: int64

In [20]:
titanic["Age"].head(10)

0     22
1      -
2     26
3     na
4     35
5    NaN
6     54
7      2
8    NaN
9     14
Name: Age, dtype: object

In [32]:
## The output is a boolean value indicating whether the value that is passed into the arguement is in fact 
## missing data.
## "True" stands for missing value,while "False" stands for not missing value.
titanic['Age'].isnull().head(10)

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7    False
8     True
9    False
Name: Age, dtype: bool